-- за основу взят сайт ламоды
-- в моем примере представлены 15 таблиц
-- 1.users -таблица пользователей с минимальным наборов данных
-- 2.profiles - подробная информация по пользователям
-- 3.store - таблица складов номер склада, адрес
-- 4.quantity таблица остатков сколько товара осталось на каком складе
-- 5.discount таблица скидок на какой товар действует скидка
-- 6.type_clothes - тип товара (обувь, аксессуары, одежда)
-- 7.catalog - таблица с минимальным нобором данных по товору 
-- 8.catalog_description - подробная таблица с описанием каждого товара
-- 9.status_order - таблица статуса заказов (доставлено, собирается заказ и.т.д)
-- 10.orders_items - таблица с номерами заказов из таблицы orders  а так же с указанием количества заказаного товара
-- 11.orders -таблица с номерами заказов и данными пользователя
-- 12.courier -таблица информации по курьерам
-- 13.reviews таблица отзывов и оценок
-- 14.pick_up_points - таблица пунктов выдачи
-- 15.media - таблица медиа файлов, могут размещаться только фотографии разных разрешений


